<h1 style="font-size: 2.5em;">MENGGANTI NAMA(LABEL) KOLOM PADA DATA FRAME</h1>

__Import Modules__

In [3]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

2.2.2
1.26.4

__Persiapan Data Frame__

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  6  9  6  2  2
1  8  3  1  6  5
2  3  5  6  6  3
3  2  5  9  8  5
4  3  3  2  1  9

__Mengganti Nama (Label) 1 Kolom Pada Data Frame__

In [9]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  6  9     6  2  2
1  8  3     1  6  5
2  3  5     6  6  3
3  2  5     9  8  5
4  3  3     2  1  9

__Mengganti Nama (Label) Banyak Kolom Pada Data Frame__

In [14]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     6       9  6     2  2
1     8       3  1     6  5
2     3       5  6     6  3
3     2       5  9     8  5
4     3       3  2     1  9